# Credit Card Application Model

We'll start by preprocessing the data

## Preprocessing

In [26]:
import pandas as pd

applicationRecord = pd.read_csv('application_record.csv')
creditRecord = pd.read_csv('credit_record.csv')

#Get counts of application record and credit record
print(creditRecord.count())
print("\n")
print(applicationRecord.count())

ID                1048575
MONTHS_BALANCE    1048575
STATUS            1048575
dtype: int64


ID                     438557
CODE_GENDER            438557
FLAG_OWN_CAR           438557
FLAG_OWN_REALTY        438557
CNT_CHILDREN           438557
AMT_INCOME_TOTAL       438557
NAME_INCOME_TYPE       438557
NAME_EDUCATION_TYPE    438557
NAME_FAMILY_STATUS     438557
NAME_HOUSING_TYPE      438557
DAYS_BIRTH             438557
DAYS_EMPLOYED          438557
FLAG_MOBIL             438557
FLAG_WORK_PHONE        438557
FLAG_PHONE             438557
FLAG_EMAIL             438557
OCCUPATION_TYPE        304354
CNT_FAM_MEMBERS        438557
dtype: int64

### Observations

There exist two obvious issues:
1. The number of application records is less than the number of credit records
2. The OCCUPATION_TYPE column has less values than the rest of the columns (suggesting NA values in play)

The first thing we'll begin doing is prune the columns we do not need to use in the applicationRecord set:
CODE_GENDER, CNT_CHILDREN, FLAG_MOBIL, FLAG_WORK_PHONE, FLAG_PHONE, FLAG_EMAIL, OCCUPATION_TYPE, CNT_FAM_MEMBERS

In [27]:
#First we'll look at our columns before the drop
applicationRecord.columns

Index(['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN',
       'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE',
       'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS'],
      dtype='object')

In [28]:
#Drop the unnecessary columns and check our new set of columns
applicationRecord = applicationRecord.drop(columns=["CODE_GENDER", 
                                          "CNT_CHILDREN", 
                                          "FLAG_MOBIL", 
                                          "FLAG_WORK_PHONE", 
                                          "FLAG_PHONE",
                                          "FLAG_EMAIL",
                                          "OCCUPATION_TYPE",
                                          "CNT_FAM_MEMBERS"])
applicationRecord.columns

Index(['ID', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'AMT_INCOME_TOTAL',
       'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE', 'NAME_FAMILY_STATUS',
       'NAME_HOUSING_TYPE', 'DAYS_BIRTH', 'DAYS_EMPLOYED'],
      dtype='object')

### What next?

Now that we have the only columns we need, we can merge the two dataframes called "comprehensive", which includes the columns of both dataframes while also aligning the data from one ID to its corresponding data from both datasets

In [36]:
comprehensive = pd.merge(applicationRecord, creditRecord)
comprehensive.shape

(777715, 12)

In [30]:
comprehensive.head(20)

,ID,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,MONTHS_BALANCE,STATUS
0,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,0,C
1,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-1,C
2,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-2,C
3,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-3,C
4,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-4,C
5,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-5,C
6,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-6,C
7,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-7,C
8,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-8,C
9,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-9,C
10,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-10,C
11,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-11,C
12,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-12,C
13,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-13,1
14,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-14,0
15,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-15,X
16,5008805,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,0,C
17,5008805,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-1,C
18,5008805,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-2,C
19,5008805,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,-3,C

### Observations
We have multiple entries for the same person, which is important to keep for the sake of better understanding when we throw the data into an unsupervised ML model. We may be able to gain insight into something like their balance or status in relation to some other data point we haven't yet considered. 

Moving from this,  our "DAYS_BIRTH" column is incredibly unintuitive for humans to read, so our next step will be to convert it to years. And because the we don't care about fractions of a year, we'll use floor division

In [37]:
#Divide the DAYS_BIRTH to years for our use
import numpy as np
comprehensive["DAYS_BIRTH"] = comprehensive["DAYS_BIRTH"].div(-365).apply(np.floor)

#We divided by -365 to get the values from negative to positive

In [38]:
#Rename DAYS_BIRTH to YEARS_OLD
comprehensive = comprehensive.rename(columns={"DAYS_BIRTH":"YEARS_OLD"})
comprehensive.head(100)

,ID,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,YEARS_OLD,DAYS_EMPLOYED,MONTHS_BALANCE,STATUS
0,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,32.0,-4542,0,C
1,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,32.0,-4542,-1,C
2,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,32.0,-4542,-2,C
3,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,32.0,-4542,-3,C
4,5008804,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,32.0,-4542,-4,C
...,...,...,...,...,...,...,...,...,...,...,...,...
95,5008810,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,52.0,-3051,-24,0
96,5008810,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,52.0,-3051,-25,X
97,5008810,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,52.0,-3051,-26,X
98,5008811,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,52.0,-3051,0,C
99,5008811,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,52.0,-3051,-1,C

### Now what?
Let's check for null values

In [44]:
comprehensive.isnull().sum()

ID                     0
FLAG_OWN_CAR           0
FLAG_OWN_REALTY        0
AMT_INCOME_TOTAL       0
NAME_INCOME_TYPE       0
NAME_EDUCATION_TYPE    0
NAME_FAMILY_STATUS     0
NAME_HOUSING_TYPE      0
YEARS_OLD              0
DAYS_EMPLOYED          0
MONTHS_BALANCE         0
STATUS                 0
dtype: int64

In [43]:
comprehensive.to_csv('mergedApplicationCreditRecords.csv')